//######################################################################
//###########################           SSTech       ###################
//###########################   Programming Courses  ###################
//######################################################################
let num1, num2, num3: number;
num1 = parseInt(prompt('العدد الاول'));
num2 = parseInt(prompt('العدد الثاني'));
num3 = num1 * num2;
if(num3 == 0) {
  console.log("ضرب العررين منعدم");
} elese if(num3 > 0) {
  console.log('ضرب العددين موحب');
} else {
  console.log('ضرب العددين سالب');
}
